#include <iostream>
#include <Windows.h>
#include <string>

// опнейрхпнбюмхе опнцпюллш б ярхке нно
// хцпю 21:
// янярюбмше вюярх:
//  йюпрш(мнлхмюкш, люярх)
//  йнкндю(бшанп йюпр)
//  опюбхкю(йюйни йнкндни хцпючр, яйнкэйн хцпнйнб, йюй хцпю мювхмюеряъ, сякнбхъ онаедш, опюбхкю унднб)
//  хцпнйх(хлъ, демэцх, псйю)
//  бедсыхи(дкъ мюьеи опнцпюллш дюммшл сопюбкъчыхл асдер яюлю опнцпюллю)
//  ярнк(леярю хцпнйнб, ярюбйх, йнкндю нрани, яапня, якнрш дкъ йюпр)
//  псйю(мюанп йюпр с хцпнйю)
//  
//


int main() {
	SetConsoleCP(1251);
	SetConsoleOutputCP(1251);





	return 0;
}