#include <iostream>
#include <vector>

// бейрнп - щрн вюярэ яхярелш йнккейжхи stl
// VECTOR х ARRAY пеюкхгсчр лндекэ упюмемхъ: кхмеимши люяяхб
// VECTOR - пеьемхе он слнквюмхч дкъ кчани йнккейжхх дюммшу б опнце, хяонкэгнбюрэ дпсцхе рпеасеряъ рнкэйн рнцдю йнцдю еярэ нянаше рпеанбюмхъ й юкцнпхрлюл йнрнпш асдср бгюхлндеиярбнбюрэ я йнккейжхеи
// рпеанбюмхъ дкъ пюанрш:
//   1. дкъ рнцн врнаш янгдюрэ назейр бейрнпю рпеасеряъ сйюгюрэ онкмши рхо б йювеярбе рхою дкъ пюанрш
//   2. дкъ пюанрш нямнбмшу лернднб йкюяяю рхо дкъ пюанрш днкфем яндепфюрэ:
//      йнмярпсйрнп он слнквюмхч
//      йнмярпсйрнп йнохпнбюмхъ
//      опхябюхбюмхе йнохпнбюмхел
//      деярпсйрнп
//   3. дкъ пюанрш лернднб гюонкмемхъ рпеасеряъ мюкхвхе йнмярпсйрнпю я оюпюлерпюлх
//    
// 
//

class Demo {
public:

	Demo():a(-18) { std::cout << " Def constructor\n"; }
	Demo(int val):a(val){ std::cout << " Param constructor\n"; }
	Demo(const Demo&other):a(other.a){ std::cout << " Copy constructor\n"; }
	~Demo(){ std::cout << " Def destructor\n"; }
private:
	int a;
};




int main() {
	// 1
	std::vector<int> arr;// бейрнп нр онкмнцн рхою int
	//std::vector<void> arr2;// бейрнпю нр меонкмнцн рхою void - ме пюанрюер
	// 2
	std::vector<Demo> arr3(3);
	// опх янгдюмхе бейрнпю б ецн йнмярпсйрнп лнфмн оепедюрэ йнмярпсйрнп, щрн янгдюяр бейрнп б йнрнпнл асдер рюйне вхякн осяршу щкелемрнб
	// дюммши йнмярпсйрнп асдер пюанрюрэ рнкэйн еякх еярэ йнмярпсйрнп он слнквюмхч с упюмхлнцн йкюяяю   
	arr3.reserve(1000);// лернд пегепбхпсер онд хяонкэгнбюмхе оюлърэ мю ярнкэйн щкелемрнб опх опнвху пюбмшу опюбхкэмее янгдюрэ осярни бейрнп х гюпегепбхпнбюрэ оюлърэ, ю ме янгдбюрэ бейрнп осяршьей йнмярпсйрнпнл
	arr.resize(10);// хглемъер пюглеп упюмхлшу щкелемрнб(ху йнк-бн) еякх мнбши пюглеп анкэье рн б йнмеж люяяхбю днаюбкъчряъ осяршьйх еякх пюглеп лемэье рейсыецн йнк-бю рн бяе врн ме онлеярхкхяэ смхврнфючряъ
	arr3.resize(5);
	arr3.shrink_to_fit();// ме хглемъер йнк-бн упюмхлшу щкелемрнб мн нябнанфдюер мехяонкэгселши йнккейжхеи йсянй оюлърх
	// push_back emplace_back
	// дкъ нанху рпеасеряъ врнаш ашк йнмярпсйрнп я оюпюлерпюлх дкъ пюанрш push_back  рпеасеряъ днонкмхрекэмн йнмярпсйрнп йнохпнбюмхъ
	arr3.push_back(Demo(4));
	arr3.emplace_back(6);
	arr.pop_back();// сдюкъер яюлши онякедмхи щкелемр люяяхбю(пюглеп слемэьюеряъ)
	auto it = arr3.begin(); // лернд дюер хрепюрнп мю мювюкн йнккейжхх
	arr3.erase(it+2);
	// лш сдюкхкх щкелемр мю 2 ъвеийх нрярюъыхи нр мювюкю
	// пюглеыемхе щкелемрнб мю мсфмни онгхжхх
	

	arr3.insert(it+2, Demo(8));
	arr3.emplace(arr3.begin()+3, 6);
	return 0;
}